{
    "class_name": "Model", 
    "keras_version": "2.0.8", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        28, 
                        28, 
                        1
                    ], 
                    "name": "Input", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "Input"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv1", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        9, 
                        9
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "Input", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "primarycap_conv2d", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        9, 
                        9
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "primarycap_conv2d"
            }, 
            {
                "class_name": "Reshape", 
                "config": {
                    "target_shape": [
                        1152, 
                        8
                    ], 
                    "trainable": true, 
                    "name": "primarycap_reshape"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "primarycap_conv2d", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "primarycap_reshape"
            }, 
            {
                "class_name": "Squash", 
                "config": {
                    "trainable": true, 
                    "name": "primarycap_sqash", 
                    "axis": -1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "primarycap_reshape", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "primarycap_sqash"
            }, 
            {
                "class_name": "CapsuleLayer", 
                "config": {
                    "num_routing": 3, 
                    "dim_capsule": 16, 
                    "trainable": true, 
                    "name": "digitcaps", 
                    "num_capsule": 10
                }, 
                "inbound_nodes": [
                    [
                        [
                            "primarycap_sqash", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "digitcaps"
            }, 
            {
                "class_name": "InputLayer", 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        10
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input_1"
            }, 
            {
                "class_name": "MaskCapsule", 
                "config": {
                    "trainable": true, 
                    "name": "mask_capsule_1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "digitcaps", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "mask_capsule_1"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 512, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "mask_capsule_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dense_1"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_2", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 1024, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dense_2"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_3", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "sigmoid", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 784, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dense_3"
            }, 
            {
                "class_name": "Length", 
                "config": {
                    "trainable": true, 
                    "name": "capsnet"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "digitcaps", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "capsnet"
            }, 
            {
                "class_name": "Reshape", 
                "config": {
                    "target_shape": [
                        28, 
                        28, 
                        1
                    ], 
                    "trainable": true, 
                    "name": "out_recon"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "out_recon"
            }
        ], 
        "input_layers": [
            [
                "Input", 
                0, 
                0
            ], 
            [
                "input_1", 
                0, 
                0
            ]
        ], 
        "output_layers": [
            [
                "capsnet", 
                0, 
                0
            ], 
            [
                "out_recon", 
                0, 
                0
            ]
        ], 
        "name": "CapsNet"
    }, 
    "backend": "tensorflow"
}