{"keras_version": "2.1.3", "backend": "tensorflow", "config": {"name": "vgg19", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block1_conv1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block1_conv2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block2_conv1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block2_conv2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block3_conv1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block3_conv2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block3_conv3", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_conv4", "config": {"filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block3_conv4", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block4_conv1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block4_conv2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block4_conv3", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_conv4", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block4_conv4", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block5_conv1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block5_conv2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block5_conv3", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_conv4", "config": {"filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "name": "block5_conv4", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "use_bias": true, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "name": "fc1", "kernel_regularizer": null, "use_bias": true, "units": 4096, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "name": "fc2", "kernel_regularizer": null, "use_bias": true, "units": 4096, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "name": "predictions", "kernel_regularizer": null, "use_bias": true, "units": 1000, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "class_name": "Model"}