{
    "class_name": "Model",
    "config": {
        "name": "vgg19",
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "predictions",
                0,
                0
            ]
        ],
        "layers": [
            {
                "name": "input_1",
                "config": {
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": [],
                "class_name": "InputLayer"
            },
            {
                "name": "block1_conv1",
                "config": {
                    "name": "block1_conv1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 64,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block1_conv2",
                "config": {
                    "name": "block1_conv2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 64,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block1_pool",
                "config": {
                    "name": "block1_pool",
                    "pool_size": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "MaxPooling2D"
            },
            {
                "name": "block2_conv1",
                "config": {
                    "name": "block2_conv1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 128,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block2_conv2",
                "config": {
                    "name": "block2_conv2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 128,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block2_pool",
                "config": {
                    "name": "block2_pool",
                    "pool_size": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "MaxPooling2D"
            },
            {
                "name": "block3_conv1",
                "config": {
                    "name": "block3_conv1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 256,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block3_conv2",
                "config": {
                    "name": "block3_conv2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 256,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block3_conv3",
                "config": {
                    "name": "block3_conv3",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 256,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block3_conv4",
                "config": {
                    "name": "block3_conv4",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 256,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block3_pool",
                "config": {
                    "name": "block3_pool",
                    "pool_size": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "MaxPooling2D"
            },
            {
                "name": "block4_conv1",
                "config": {
                    "name": "block4_conv1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block4_conv2",
                "config": {
                    "name": "block4_conv2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block4_conv3",
                "config": {
                    "name": "block4_conv3",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block4_conv4",
                "config": {
                    "name": "block4_conv4",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block4_pool",
                "config": {
                    "name": "block4_pool",
                    "pool_size": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "MaxPooling2D"
            },
            {
                "name": "block5_conv1",
                "config": {
                    "name": "block5_conv1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block5_conv2",
                "config": {
                    "name": "block5_conv2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block5_conv3",
                "config": {
                    "name": "block5_conv3",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block5_conv4",
                "config": {
                    "name": "block5_conv4",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "data_format": "channels_last",
                    "kernel_constraint": null,
                    "use_bias": true,
                    "activation": "relu",
                    "strides": [
                        1,
                        1
                    ],
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "trainable": true,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "filters": 512,
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Conv2D"
            },
            {
                "name": "block5_pool",
                "config": {
                    "name": "block5_pool",
                    "pool_size": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "MaxPooling2D"
            },
            {
                "name": "flatten",
                "config": {
                    "name": "flatten",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Flatten"
            },
            {
                "name": "fc1",
                "config": {
                    "name": "fc1",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "kernel_constraint": null,
                    "activation": "relu",
                    "units": 4096,
                    "use_bias": true,
                    "trainable": true,
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Dense"
            },
            {
                "name": "fc2",
                "config": {
                    "name": "fc2",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "kernel_constraint": null,
                    "activation": "relu",
                    "units": 4096,
                    "use_bias": true,
                    "trainable": true,
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "fc1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Dense"
            },
            {
                "name": "predictions",
                "config": {
                    "name": "predictions",
                    "bias_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "kernel_constraint": null,
                    "activation": "softmax",
                    "units": 1000,
                    "use_bias": true,
                    "trainable": true,
                    "activity_regularizer": null,
                    "bias_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null
                },
                "inbound_nodes": [
                    [
                        [
                            "fc2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "class_name": "Dense"
            }
        ]
    },
    "keras_version": "2.1.3",
    "backend": "tensorflow"
}